module.exports = {
  "admin": {
    "register": {
      "emailNull":         "Заполните, пожалуйста, email адрес",
      "emailIncorrect":    "Некорректный email-адрес",
      "passwordLength":    "Пароль должен быть не менее 6 и не более 50 символов",
      "passwordsNotEqual": "Пароли должны совпадать",
      "firstNameNull":     "Заполните, пожалуйста, имя",
      "lastNameNull":      "Заполните, пожалуйста, фамилию",
      "success":           "Ваши данные сохранены, ждите ответа",
      "errorErrors":       "Пожалуйста, исправьте ошибки",
      "errorDuplicate":    "Заявка с таким email-адресом уже была подана ранее",
      "errorDatabase":     "Ошибка сохранения данных, пожалуйста, повторите позже"
    },
    "login": {
      "emailNull":         "Заполните, пожалуйста, email адрес",
      "emailIncorrect":    "Некорректный email-адрес",
      "passwordNull":      "Заполните, пожалуйста, пароль",
      "success":           "Данные верны, выполняется вход",
      "errorErrors":       "Пожалуйста, исправьте ошибки",
      "errorIncorrect":    "Нет администратора с таким e-mail адресом и паролем",
      "errorDatabase":     "Ошибка сервиса, пожалуйста, повторите позже"
    }
  }
};